Revit 2024 API
PreviewControl.ScrollbarVisibility Property
 The visibility of the preview view scrollbars.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ScrollbarVisibility ScrollbarVisibility { get; set; }
Visual Basic
Public Property ScrollbarVisibility As ScrollbarVisibility
	Get
	Set
Visual C++
public:
property ScrollbarVisibility ScrollbarVisibility {
	ScrollbarVisibility get ();
	void set (ScrollbarVisibility value);
}
See Also
PreviewControl Class
Autodesk.Revit.UI Namespace